[
  {
    "name": "Ernest Hemingway",
    "description": "Ernest Miller Hemingway was an American novelist, short-story writer, and journalist",
    "born": "1899-07-21",
    "died": "1961-07-02"
  },
  {
    "name": "Marilyn Monroe",
    "description": "Marilyn Monroe was an American actress, singer, and model. Famous for playing comedic \"blonde bombshell\" characters, she became one of the most popular sex symbols of the 1950s and early 1960s",
    "born": "1926-06-01",
    "died": "1962-08-04"
  },
  {
    "name": "Elvis Presley",
    "description": "Elvis Aaron Presley was an American singer and actor. Dubbed the \"King of Rock and Roll\", he is regarded as one of the most significant cultural figures of the 20th century",
    "born": "1935-01-08",
    "died": "1977-08-16"
  },
  {
    "name": "John Lennon",
    "description": "John Lennon was an English singer, songwriter, musician and peace activist who achieved worldwide fame as the founder, co-songwriter, co-lead vocalist and rhythm guitarist of the Beatles",
    "born": "1940-10-09",
    "died": "1980-12-08"
  },
  {
    "name": "Bruce Lee",
    "description": "Bruce Lee was a Hong Kong and American martial artist, martial arts instructor, actor, director, screenwriter, producer, and philosopher",
    "born": "1940-11-27",
    "died": "1973-07-20"
  },
  {
    "name": "Michael Jackson",
    "description": "Michael Joseph Jackson was an American singer, songwriter, dancer, and philanthropist. Dubbed the \"King of Pop\", he is regarded as one of the most significant cultural figures of the 20th century.",
    "born": "1958-08-29",
    "died": "2009-06-25"
  },
  {
    "name": "Kurt Cobain",
    "description": "Kurt Donald Cobain was an American singer, songwriter and artist. He was the guitarist, lead vocalist and primary songwriter of the rock band Nirvana",
    "born": "1967-02-20",
    "died": "1994-04-05"
  },
  {
    "name": "Tupac Shakur",
    "description": "Tupac Amaru Shakur, also known as 2Pac and Makaveli, was an American rapper, actor, and songwriter",
    "born": "1971-06-16",
    "died": "1996-09-13"
  },
  {
    "name": "The Notorious B.I.G.",
    "description": "Christopher George Latore Wallace, better known by his stage names the Notorious B.I.G., Biggie Smalls, or simply Biggie, was an American rapper and songwriter",
    "born": "1972-05-21",
    "died": "1997-03-09"
  },
  {
    "name": "Lil Peep",
    "description": "Gustav Elijah Åhr, known professionally as Lil Peep was a Swedish-American rapper, singer, and songwriter. He was a member of the emo rap collective GothBoiClique",
    "born": "1996-11-01",
    "died": "2017-11-15"
  },
  {
    "name": "XXXTentacion",
    "description": "Jahseh Dwayne Ricardo Onfroy, known professionally as XXXTentacion and commonly referred to as simply X, was an American rapper, singer, and songwriter",
    "born": "1998-01-23",
    "died": "2018-06-18"
  },
  {
    "name": "Juice Wrld",
    "description": "Jarad Anthony Higgins, known professionally as Juice Wrld, was an American rapper, singer, and songwriter. He was a leading figure in the emo rap and SoundCloud rap genres",
    "born": "1998-12-02",
    "died": "2019-12-08"
  }
]
